benchmarks/results/load-summary.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/allanflavio/Documents/projects/PERSONAL/backend-challenges/fiscalbridge-rails-nfse-platform/benchmarks/load.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 10 looping VUs for 1m0s (gracefulStop: 30s)


Run       [ 100% ] setup()
default   [   0% ]

running (0m02.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 10 VUs  0m00.5s/1m0s

running (0m03.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 10 VUs  0m01.5s/1m0s

running (0m04.0s), 10/10 VUs, 12 complete and 0 interrupted iterations
default   [   4% ] 10 VUs  0m02.5s/1m0s

running (0m05.0s), 10/10 VUs, 36 complete and 0 interrupted iterations
default   [   6% ] 10 VUs  0m03.5s/1m0s

running (0m06.0s), 10/10 VUs, 64 complete and 0 interrupted iterations
default   [   8% ] 10 VUs  0m04.5s/1m0s

running (0m07.0s), 10/10 VUs, 95 complete and 0 interrupted iterations
default   [   9% ] 10 VUs  0m05.5s/1m0s

running (0m08.0s), 10/10 VUs, 117 complete and 0 interrupted iterations
default   [  11% ] 10 VUs  0m06.5s/1m0s

running (0m09.0s), 10/10 VUs, 135 complete and 0 interrupted iterations
default   [  13% ] 10 VUs  0m07.5s/1m0s

running (0m10.0s), 10/10 VUs, 157 complete and 0 interrupted iterations
default   [  14% ] 10 VUs  0m08.5s/1m0s

running (0m11.0s), 10/10 VUs, 178 complete and 0 interrupted iterations
default   [  16% ] 10 VUs  0m09.5s/1m0s

running (0m12.0s), 10/10 VUs, 192 complete and 0 interrupted iterations
default   [  18% ] 10 VUs  0m10.5s/1m0s

running (0m13.0s), 10/10 VUs, 219 complete and 0 interrupted iterations
default   [  19% ] 10 VUs  0m11.5s/1m0s

running (0m14.0s), 10/10 VUs, 248 complete and 0 interrupted iterations
default   [  21% ] 10 VUs  0m12.5s/1m0s

running (0m15.0s), 10/10 VUs, 271 complete and 0 interrupted iterations
default   [  23% ] 10 VUs  0m13.5s/1m0s

running (0m16.0s), 10/10 VUs, 298 complete and 0 interrupted iterations
default   [  24% ] 10 VUs  0m14.5s/1m0s

running (0m17.0s), 10/10 VUs, 320 complete and 0 interrupted iterations
default   [  26% ] 10 VUs  0m15.5s/1m0s

running (0m18.0s), 10/10 VUs, 344 complete and 0 interrupted iterations
default   [  28% ] 10 VUs  0m16.5s/1m0s

running (0m19.0s), 10/10 VUs, 366 complete and 0 interrupted iterations
default   [  29% ] 10 VUs  0m17.5s/1m0s

running (0m20.0s), 10/10 VUs, 392 complete and 0 interrupted iterations
default   [  31% ] 10 VUs  0m18.5s/1m0s

running (0m21.0s), 10/10 VUs, 412 complete and 0 interrupted iterations
default   [  33% ] 10 VUs  0m19.5s/1m0s

running (0m22.0s), 10/10 VUs, 436 complete and 0 interrupted iterations
default   [  34% ] 10 VUs  0m20.5s/1m0s

running (0m23.0s), 10/10 VUs, 458 complete and 0 interrupted iterations
default   [  36% ] 10 VUs  0m21.5s/1m0s

running (0m24.0s), 10/10 VUs, 479 complete and 0 interrupted iterations
default   [  38% ] 10 VUs  0m22.5s/1m0s

running (0m25.0s), 10/10 VUs, 507 complete and 0 interrupted iterations
default   [  39% ] 10 VUs  0m23.5s/1m0s

running (0m26.0s), 10/10 VUs, 531 complete and 0 interrupted iterations
default   [  41% ] 10 VUs  0m24.5s/1m0s

running (0m27.0s), 10/10 VUs, 561 complete and 0 interrupted iterations
default   [  43% ] 10 VUs  0m25.5s/1m0s

running (0m28.0s), 10/10 VUs, 584 complete and 0 interrupted iterations
default   [  44% ] 10 VUs  0m26.5s/1m0s

running (0m29.0s), 10/10 VUs, 607 complete and 0 interrupted iterations
default   [  46% ] 10 VUs  0m27.5s/1m0s

running (0m30.0s), 10/10 VUs, 628 complete and 0 interrupted iterations
default   [  48% ] 10 VUs  0m28.5s/1m0s

running (0m31.0s), 10/10 VUs, 648 complete and 0 interrupted iterations
default   [  49% ] 10 VUs  0m29.5s/1m0s

running (0m32.0s), 10/10 VUs, 669 complete and 0 interrupted iterations
default   [  51% ] 10 VUs  0m30.5s/1m0s

running (0m33.0s), 10/10 VUs, 695 complete and 0 interrupted iterations
default   [  53% ] 10 VUs  0m31.5s/1m0s

running (0m34.0s), 10/10 VUs, 717 complete and 0 interrupted iterations
default   [  54% ] 10 VUs  0m32.5s/1m0s

running (0m35.0s), 10/10 VUs, 744 complete and 0 interrupted iterations
default   [  56% ] 10 VUs  0m33.5s/1m0s

running (0m36.0s), 10/10 VUs, 773 complete and 0 interrupted iterations
default   [  58% ] 10 VUs  0m34.5s/1m0s

running (0m37.0s), 10/10 VUs, 795 complete and 0 interrupted iterations
default   [  59% ] 10 VUs  0m35.5s/1m0s

running (0m38.0s), 10/10 VUs, 819 complete and 0 interrupted iterations
default   [  61% ] 10 VUs  0m36.5s/1m0s

running (0m39.0s), 10/10 VUs, 845 complete and 0 interrupted iterations
default   [  63% ] 10 VUs  0m37.5s/1m0s

running (0m40.0s), 10/10 VUs, 865 complete and 0 interrupted iterations
default   [  64% ] 10 VUs  0m38.5s/1m0s

running (0m41.0s), 10/10 VUs, 887 complete and 0 interrupted iterations
default   [  66% ] 10 VUs  0m39.5s/1m0s

running (0m42.0s), 10/10 VUs, 909 complete and 0 interrupted iterations
default   [  68% ] 10 VUs  0m40.5s/1m0s

running (0m43.0s), 10/10 VUs, 933 complete and 0 interrupted iterations
default   [  69% ] 10 VUs  0m41.5s/1m0s

running (0m44.0s), 10/10 VUs, 960 complete and 0 interrupted iterations
default   [  71% ] 10 VUs  0m42.5s/1m0s

running (0m45.0s), 10/10 VUs, 987 complete and 0 interrupted iterations
default   [  73% ] 10 VUs  0m43.5s/1m0s

running (0m46.0s), 10/10 VUs, 1009 complete and 0 interrupted iterations
default   [  74% ] 10 VUs  0m44.5s/1m0s

running (0m47.0s), 10/10 VUs, 1034 complete and 0 interrupted iterations
default   [  76% ] 10 VUs  0m45.5s/1m0s

running (0m48.0s), 10/10 VUs, 1061 complete and 0 interrupted iterations
default   [  78% ] 10 VUs  0m46.5s/1m0s

running (0m49.0s), 10/10 VUs, 1081 complete and 0 interrupted iterations
default   [  79% ] 10 VUs  0m47.5s/1m0s

running (0m50.0s), 10/10 VUs, 1103 complete and 0 interrupted iterations
default   [  81% ] 10 VUs  0m48.5s/1m0s

running (0m51.0s), 10/10 VUs, 1126 complete and 0 interrupted iterations
default   [  83% ] 10 VUs  0m49.5s/1m0s

running (0m52.0s), 10/10 VUs, 1146 complete and 0 interrupted iterations
default   [  84% ] 10 VUs  0m50.5s/1m0s

running (0m53.0s), 10/10 VUs, 1169 complete and 0 interrupted iterations
default   [  86% ] 10 VUs  0m51.5s/1m0s

running (0m54.0s), 10/10 VUs, 1192 complete and 0 interrupted iterations
default   [  88% ] 10 VUs  0m52.5s/1m0s

running (0m55.0s), 10/10 VUs, 1215 complete and 0 interrupted iterations
default   [  89% ] 10 VUs  0m53.5s/1m0s

running (0m56.0s), 10/10 VUs, 1238 complete and 0 interrupted iterations
default   [  91% ] 10 VUs  0m54.5s/1m0s

running (0m57.0s), 10/10 VUs, 1250 complete and 0 interrupted iterations
default   [  93% ] 10 VUs  0m55.5s/1m0s

running (0m58.0s), 10/10 VUs, 1267 complete and 0 interrupted iterations
default   [  94% ] 10 VUs  0m56.5s/1m0s

running (0m59.0s), 10/10 VUs, 1283 complete and 0 interrupted iterations
default   [  96% ] 10 VUs  0m57.5s/1m0s

running (1m00.0s), 10/10 VUs, 1305 complete and 0 interrupted iterations
default   [  98% ] 10 VUs  0m58.5s/1m0s

running (1m01.0s), 10/10 VUs, 1325 complete and 0 interrupted iterations
default   [  99% ] 10 VUs  0m59.5s/1m0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<600' p(95)=245.94ms

    http_req_failed
    ✓ 'rate<0.02' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 2687    43.479726/s
    checks_succeeded...: 100.00% 2687 out of 2687
    checks_failed......: 0.00%   0 out of 2687

    ✓ bootstrap created
    ✓ fiscal profile created
    ✓ customer created
    ✓ invoice created
    ✓ invoice read

    HTTP
    http_req_duration..............: avg=98.9ms   min=3.96ms   med=76.67ms  max=1.5s  p(90)=191.68ms p(95)=245.94ms p(99)=405.12ms
      { expected_response:true }...: avg=98.9ms   min=3.96ms   med=76.67ms  max=1.5s  p(90)=191.68ms p(95)=245.94ms p(99)=405.12ms
    http_req_failed................: 0.00%  0 out of 2687
    http_reqs......................: 2687   43.479726/s

    EXECUTION
    iteration_duration.............: avg=448.22ms min=266.96ms med=421.79ms max=1.94s p(90)=593.81ms p(95)=660.61ms p(99)=916.11ms
    iterations.....................: 1342   21.715591/s
    vus............................: 10     min=0         max=10
    vus_max........................: 10     min=10        max=10

    NETWORK
    data_received..................: 5.2 MB 84 kB/s
    data_sent......................: 938 kB 15 kB/s



running (1m01.8s), 00/10 VUs, 1342 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  1m0s